//Все символы кодовой таблицы.
#include <iostream>
using namespace std;
int main(){
 unsigned char ch;
 ch = 32;
 while(ch){
  cout<<ch<<' ';
  ch++;			// если к 255 прибавить 1, то
 }             			//сбрасывается в 0, и цикл завершается
 
 cout<<endl<<endl<<"************************************************************"<<endl;
 cout<<endl;

 int i;
 for(i = 32; i <= 255; i++)
  cout<<i<<' '<<char(i)<<' ';
 cout<<endl<<endl<<"************************************************************"<<endl;
 cout<<endl;


 for(int j = 32; j < 128; j++){              	 
  int k = rand() % 96 + 32; 	     	// символы первой половины кодовой таблицы
  cout<<k<<' '<<char(k)<<' ';           	// прибавляем 32, чтобы не включать
 }				// управляющие символы
 cout<<endl<<endl<<"*************************************************************"<<endl;
 cout<<endl;

 char st[15];
 for(int j = 0; j < 14; j++){   		 // заполнение строки случайными символами
   int k = rand() % 96 + 32;
   cout<<k<<' '<<char(k)<<' ';
   st[j] = char(k);
 }
 st[14] = '\0';			// !!!!!!!!!
 cout<<endl;
 cout<<"stroka = "<<endl;
 cout<<st<<endl;
 cout<<"**************************************************************************"<<endl;
 cout<<endl;

 ch = 'A';
 cout<<' '<<ch<<' '<<int(ch)<<endl;
 system("pause");
}